** Check and/or install python3-pip
If pip3 is not installed, then the result should show an error.
#+NAME: Check pip
#+BEGIN_SRC shell :results raw drawer
python -m pip --version
#+END_SRC

#+RESULTS: Check pip
:results:
pip 23.0.1 from /usr/lib/python3.10/site-packages/pip (python 3.10)
:end:

** Install esptool
Install /esptool/ to interface with the device.
#+NAME: Install esptool
#+BEGIN_SRC shell :dir /sudo:: :results raw drawer
sudo pip3 install esptool
#+END_SRC

#+RESULTS: Install esptool
:results:
Collecting esptool
  Downloading esptool-4.5.1.tar.gz (252 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 252.2/252.2 kB 325.4 kB/s eta 0:00:00

  Preparing metadata (setup.py) ... [?25l- done
[?25hCollecting bitstring>=3.1.6
  Downloading bitstring-4.0.2-py3-none-any.whl (46 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 46.0/46.0 kB 521.2 kB/s eta 0:00:00

Requirement already satisfied: cryptography>=2.1.4 in /usr/lib/python3.10/site-packages (from esptool) (39.0.2)
Collecting ecdsa>=0.16.0
  Downloading ecdsa-0.18.0-py2.py3-none-any.whl (142 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 142.9/142.9 kB 615.5 kB/s eta 0:00:00

Collecting pyserial>=3.0
  Downloading pyserial-3.5-py2.py3-none-any.whl (90 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 90.6/90.6 kB 662.8 kB/s eta 0:00:00

Collecting reedsolo<=1.6.0,>=1.5.3
  Downloading reedsolo-1.6.0.tar.gz (278 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 278.6/278.6 kB 175.7 kB/s eta 0:00:00

  Preparing metadata (setup.py) ... [?25l- \ done
[?25hRequirement already satisfied: cffi>=1.12 in /usr/lib/python3.10/site-packages (from cryptography>=2.1.4->esptool) (1.15.1)
Requirement already satisfied: six>=1.9.0 in /usr/lib/python3.10/site-packages (from ecdsa>=0.16.0->esptool) (1.16.0)
Requirement already satisfied: pycparser in /usr/lib/python3.10/site-packages (from cffi>=1.12->cryptography>=2.1.4->esptool) (2.21)
Building wheels for collected packages: esptool, reedsolo
  Building wheel for esptool (setup.py) ... [?25l- \ done
[?25h  Created wheel for esptool: filename=esptool-4.5.1-py3-none-any.whl size=320920 sha256=628808dc90df1d22eecf3b28c60ab92c8d37aabfab892178a408d4ccb5313861
  Stored in directory: /root/.cache/pip/wheels/0c/c1/d2/79a44d2615160cce5930be100b5d238e16c5a001f156674b64
  Building wheel for reedsolo (setup.py) ... [?25l- \ | / - \ done
[?25h  Created wheel for reedsolo: filename=reedsolo-1.6.0-cp310-cp310-linux_x86_64.whl size=1000967 sha256=078b09517235b12c78c49eb073ad872f2d32097702f9bc2b991815d517e77950
  Stored in directory: /root/.cache/pip/wheels/e2/64/52/65c5db6d7c5a7bae6a3660e818d913071833adfde123a67cb9
Successfully built esptool reedsolo
Installing collected packages: reedsolo, pyserial, ecdsa, bitstring, esptool
Successfully installed bitstring-4.0.2 ecdsa-0.18.0 esptool-4.5.1 pyserial-3.5 reedsolo-1.6.0
:end:

** Find Device
Now run the following code if you forgot where the USB to Serial device is:

#+NAME: Find Serial Devices
#+BEGIN_SRC shell :dir /sudo:: :results raw drawer
echo "Usually the device is named ttyUSB#"
sudo dmesg | grep tty
#+END_SRC

#+RESULTS: Find Serial Devices
:results:
Usually the device is named ttyUSB#
[    0.131904] printk: console [tty0] enabled
[    0.414941] tty tty33: hash matches
[    3.864352] systemd[1]: Created slice Slice /system/getty.
[    5.232450] dw-apb-uart.2: ttyS4 at MMIO 0x9432e000 (irq = 20, base_baud = 115200) is a 16550A
[    7.412340] usb 1-3.3: FTDI USB Serial Device converter now attached to ttyUSB0
[ 4635.489714] ftdi_sio ttyUSB0: FTDI USB Serial Device converter now disconnected from ttyUSB0
[19020.329682] usb 1-3.3: FTDI USB Serial Device converter now attached to ttyUSB0
[21972.419922] ftdi_sio ttyUSB0: FTDI USB Serial Device converter now disconnected from ttyUSB0
[21974.245451] usb 1-3.3: FTDI USB Serial Device converter now attached to ttyUSB1
:end:

** Erase Flash
Now we can erase the flash memory. Make sure the right port is selected.
If any errors occur, disconnect and reconnect the device and set in download mode again.

#+NAME: Erase ESP32 Flash
#+BEGIN_SRC shell :dir /sudo:: :results raw drawer
sudo esptool.py -p /dev/ttyUSB0 erase_flash
#+END_SRC

#+RESULTS: Erase ESP32 Flash
:results:
Usually the device is named ttyUSB#
[    0.131904] printk: console [tty0] enabled
[    0.414941] tty tty33: hash matches
[    3.864352] systemd[1]: Created slice Slice /system/getty.
[    5.232450] dw-apb-uart.2: ttyS4 at MMIO 0x9432e000 (irq = 20, base_baud = 115200) is a 16550A
[    7.412340] usb 1-3.3: FTDI USB Serial Device converter now attached to ttyUSB0
[ 4635.489714] ftdi_sio ttyUSB0: FTDI USB Serial Device converter now disconnected from ttyUSB0
[19020.329682] usb 1-3.3: FTDI USB Serial Device converter now attached to ttyUSB0
:end:

